app/Controllers/Role/AdminController.php

    public function dashboard(): string
    {
        // Set session data for role-based template
        session()->set([
            'user_role' => 'admin',
            'user_name' => 'System Administrator'
        ]);

        // Get statistics
        $contestantModel = new ContestantModel();
        $userModel = new UserModel();
        $roundModel = new RoundModel();
        $scoreModel = new ScoreModel();

        $totalContestants = $contestantModel->where('status', 'active')->countAllResults();
        $db = \Config\Database::connect();
        $eliminatedContestants = $db->table('round_contestants')
            ->select('contestant_id')
            ->where('state', 'eliminated')
            ->groupBy('contestant_id')
            ->get()
            ->getNumRows();
        $activeJudges = $userModel->select('users.*')
                                   ->join('roles', 'roles.id = users.role_id')
                                   ->where('roles.name', 'judge')
                                   ->where('users.status', 'active')
                                   ->countAllResults();
        $totalRounds = $roundModel->countAllResults();
        $scoresSubmitted = $scoreModel->countAllResults();

        // Determine current round (prefer latest active, else latest completed)
        $currentRound = $roundModel->where('status', 'active')->orderBy('id', 'DESC')->first();
        if (!$currentRound) {
            $currentRound = $roundModel->where('status', 'completed')->orderBy('id', 'DESC')->first();
---
SELECT COUNT(*) AS `numrows`
FROM `contestants`
WHERE `status` = 'active'
SELECT `contestant_id`
FROM `round_contestants`
WHERE `state` = 'eliminated'
GROUP BY `contestant_id`
SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `roles`.`name` = 'judge'
AND `users`.`status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `rounds`
SELECT COUNT(*) AS `numrows`
FROM `scores`
SELECT *
FROM `rounds`
WHERE `status` = 'active'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `rounds`
WHERE `status` = 'completed'
ORDER BY `id` DESC
 LIMIT 1

            }, array_slice($rankings, 0, 5));

            // Get all active judges with their completion status for current round
            $judges_list = $db->table('users')
                ->select('users.id, users.full_name, round_judges.completed_at, round_judges.judge_round_status')
                ->join('roles', 'roles.id = users.role_id')
                ->join('round_judges', 'round_judges.judge_id = users.id AND round_judges.round_id = ' . $currentRound['id'], 'left')
                ->where('roles.name', 'judge')
                ->where('users.status', 'active')
                ->orderBy('users.full_name', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT `users`.`id`, `users`.`full_name`, `round_judges`.`completed_at`, `round_judges`.`judge_round_status`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
LEFT JOIN `round_judges` ON `round_judges`.`judge_id` = `users`.`id` AND `round_judges`.`round_id` = 8
WHERE `roles`.`name` = 'judge'
AND `users`.`status` = 'active'
ORDER BY `users`.`full_name` ASC