app/Controllers/Role/JudgeController.php

    public function dashboard()
    {
        session()->set([
            'user_role' => 'judge',
            'user_name' => session()->get('user_name') ?? 'Judge User'
        ]);

        $judgeId = session()->get('user_id') ?? 1; // Get from session
        $db = \Config\Database::connect();

        // Get active round
        $activeRound = $this->roundModel->where('status', 'active')->first();

        // Get statistics
        $totalContestants = $this->contestantModel->where('status', 'active')->countAllResults();

        // Initialize default values
        $completedScores = 0;
        $averageScore = 0;
        $currentLeaderboard = [];
        $eliminatedContestants = 0;

        if ($activeRound) {
            // Get scores completed by this judge for this round
            $completedScoresQuery = $db->table('scores')
                ->select('contestant_id')
                ->where('round_id', $activeRound['id'])
                ->where('judge_id', $judgeId)
                ->groupBy('contestant_id')
                ->get()
                ->getResultArray();
            $completedScores = count($completedScoresQuery);

            // Count eliminated contestants in this round
            $eliminatedContestants = $db->table('round_contestants')
                ->where('round_id', $activeRound['id'])
                ->where('state', 'eliminated')
                ->countAllResults();

            // Calculate average score for this judge
            $avgQuery = $db->table('scores')
                ->select('AVG(score) as avg_score')
                ->where('round_id', $activeRound['id'])
                ->where('judge_id', $judgeId)
                ->get()
                ->getRow();
---
SELECT *
FROM `rounds`
WHERE `status` = 'active'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `contestants`
WHERE `status` = 'active'
SELECT `contestant_id`
FROM `scores`
WHERE `round_id` = '5'
AND `judge_id` = '2'
GROUP BY `contestant_id`
SELECT COUNT(*) AS `numrows`
FROM `round_contestants`
WHERE `round_id` = '5'
AND `state` = 'eliminated'
SELECT AVG(score) as avg_score
FROM `scores`
WHERE `round_id` = '5'
AND `judge_id` = '2'

    public function selectRound()
    {
        session()->set([
            'user_role' => 'judge',
            'user_name' => session()->get('user_name') ?? 'Judge User'
        ]);

        $judgeId = session()->get('user_id') ?? 1;
        $db = \Config\Database::connect();

        // Fetch ALL rounds to show judges
        $rounds = $this->roundModel->orderBy('round_number', 'ASC')->findAll();
        $criteriaCounts = $this->roundCriteriaModel
            ->select('round_id, COUNT(*) AS criteria_count')
            ->groupBy('round_id')
            ->findAll();
        $criteriaMap = [];
        foreach ($criteriaCounts as $row) {
            $criteriaMap[$row['round_id']] = (int)$row['criteria_count'];
        }

        // Check which rounds this judge has completed and if they're locked
        foreach ($rounds as &$round) {
            $judgeAssignment = $db->table('round_judges')
                ->where('round_id', $round['id'])
                ->where('judge_id', $judgeId)
                ->get()
                ->getRowArray();
---
SELECT *
FROM `rounds`
ORDER BY `round_number` ASC
SELECT `round_id`, COUNT(*) AS criteria_count
FROM `round_criteria`
GROUP BY `round_id`
SELECT *
FROM `round_judges`
WHERE `round_id` = '5'
AND `judge_id` = '2'

            $round['criteria_count'] = $criteriaMap[$round['id']] ?? 0;

            // Judge completion stats for this round
            $round['completed_judges'] = $db->table('round_judges')
                ->where('round_id', $round['id'])
                ->where('completed_at IS NOT NULL', null, false)
                ->countAllResults();
            $round['total_judges'] = $db->table('round_judges')
                ->where('round_id', $round['id'])
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `round_judges`
WHERE `round_id` = '5'
AND completed_at IS NOT NULL
SELECT COUNT(*) AS `numrows`
FROM `round_judges`
WHERE `round_id` = '5'

    public function scoreRound($roundId)
    {
        session()->set([
            'user_role' => 'judge',
            'user_name' => session()->get('user_name') ?? 'Judge User'
        ]);

        $judgeId = session()->get('user_id') ?? 1;
        $db = \Config\Database::connect();

        $round = $this->roundModel->getRoundWithDetails($roundId);
        if (!$round) {
            return redirect()->to(base_url('judge/select-round'))
                           ->with('error', 'Round not found.');
        }

        // Check if judge is assigned to this round and get completion status
        $judgeAssignment = $db->table('round_judges')
            ->where('round_id', $roundId)
            ->where('judge_id', $judgeId)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `round_judges`
WHERE `round_id` = '5'
AND `judge_id` = '2'

        }

        // Get all rounds for navigation
        $all_rounds = $this->roundModel->orderBy('round_number', 'ASC')->findAll();

        // Get total active judges count once (used for all rounds)
        $totalActiveJudges = $db->table('users')
            ->join('roles', 'roles.id = users.role_id')
            ->where('roles.name', 'judge')
            ->where('users.status', 'active')
            ->countAllResults();
---
SELECT *
FROM `rounds`
ORDER BY `round_number` ASC
SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `roles`.`name` = 'judge'
AND `users`.`status` = 'active'

        // Check completion status for each round
        foreach ($all_rounds as &$rnd) {
            // Check if all active judges completed this round
            $completedJudges = $db->table('users')
                ->join('roles', 'roles.id = users.role_id')
                ->join('round_judges', 'round_judges.judge_id = users.id AND round_judges.round_id = ' . (int)$rnd['id'])
                ->where('roles.name', 'judge')
                ->where('users.status', 'active')
                ->where('round_judges.completed_at IS NOT NULL', null, false)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
JOIN `round_judges` ON `round_judges`.`judge_id` = `users`.`id` AND `round_judges`.`round_id` = 5
WHERE `roles`.`name` = 'judge'
AND `users`.`status` = 'active'
AND round_judges.completed_at IS NOT NULL

        }

        // Get existing scores for all contestants
        $existingScoresRaw = $this->scoreModel
            ->where('judge_id', $judgeId)
            ->where('round_id', $roundId)
            ->findAll();
---
SELECT *
FROM `scores`
WHERE `judge_id` = '2'
AND `round_id` = '5'

        $totalJudges = $totalActiveJudges; // Use the count calculated earlier

        // Get completed judges count for this specific round
        $judgesCompleted = $db->table('users')
            ->join('roles', 'roles.id = users.role_id')
            ->join('round_judges', 'round_judges.judge_id = users.id AND round_judges.round_id = ' . (int)$roundId)
            ->where('roles.name', 'judge')
            ->where('users.status', 'active')
            ->where('round_judges.completed_at IS NOT NULL', null, false)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
JOIN `round_judges` ON `round_judges`.`judge_id` = `users`.`id` AND `round_judges`.`round_id` = 5
WHERE `roles`.`name` = 'judge'
AND `users`.`status` = 'active'
AND round_judges.completed_at IS NOT NULL

        // Check if next round exists and is unlocked
        $nextRound = null;
        $nextRoundUnlocked = false;
        $nextRoundData = $this->roundModel
            ->where('round_number >', $round['round_number'])
            ->orderBy('round_number', 'ASC')
            ->first();
---
SELECT *
FROM `rounds`
WHERE `round_number` > '1'
ORDER BY `round_number` ASC
 LIMIT 1

        }

        // Get all judges assigned to this round with their details
        $judgesList = $db->table('round_judges')
            ->select('users.id, users.full_name as name, users.email, round_judges.completed_at')
            ->join('users', 'users.id = round_judges.judge_id')
            ->where('round_judges.round_id', $roundId)
            ->orderBy('users.full_name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `users`.`id`, `users`.`full_name` as `name`, `users`.`email`, `round_judges`.`completed_at`
FROM `round_judges`
JOIN `users` ON `users`.`id` = `round_judges`.`judge_id`
WHERE `round_judges`.`round_id` = '5'
ORDER BY `users`.`full_name` ASC