app/Controllers/Role/JudgesController.php

SELECT `users`.*, `roles`.`display_name` as `role_display_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`role_id` = '2'
ORDER BY `users`.`created_at` DESC
---
    public function index()
    {
        // Set session for template
        session()->set([
            'user_role' => 'admin',
            'user_name' => session()->get('user_name') ?? 'Admin User'
        ]);

        // Get judge role
        $judgeRole = $this->roleModel->getRoleByName('judge');

        // Get all judges (users with judge role)
        $judges = $this->userModel
            ->select('users.*, roles.display_name as role_display_name')
            ->join('roles', 'roles.id = users.role_id')
            ->where('users.role_id', $judgeRole['id'])
            ->orderBy('users.created_at', 'DESC')
            ->findAll();