app/Controllers/Role/ResultsController.php

    public function index()
    {
        session()->set([
            'user_role' => 'admin',
            'user_name' => session()->get('user_name') ?? 'Admin User'
        ]);

        // Get all rounds ordered by round number
        $rounds = $this->roundModel->orderBy('round_number', 'ASC')->findAll();

        // Determine the current round to display leaderboard for
        // Prefer the latest 'active', then 'completed', then any round with scores
        $currentRound = $this->roundModel
            ->where('status', 'active')
            ->orderBy('round_number', 'DESC')
            ->first();

        if (!$currentRound) {
            $currentRound = $this->roundModel
                ->where('status', 'completed')
                ->orderBy('round_number', 'DESC')
                ->first();
---
SELECT *
FROM `rounds`
ORDER BY `round_number` ASC
SELECT *
FROM `rounds`
WHERE `status` = 'active'
ORDER BY `round_number` DESC
 LIMIT 1
SELECT *
FROM `rounds`
WHERE `status` = 'completed'
ORDER BY `round_number` DESC
 LIMIT 1

    public function viewRound($roundId)
    {
        session()->set([
            'user_role' => 'admin',
            'user_name' => session()->get('user_name') ?? 'Admin User'
        ]);

        $round = $this->roundModel->find($roundId);
        if (!$round) {
            return redirect()->to(base_url('admin/results'))
                           ->with('error', 'Round not found.');
        }

        $this->roundModel->ensureJudgeAssignments($roundId);

        // Get rankings (will show any contestant who has scores in this round)
        $rankings = $this->scoreModel->getRoundRankings($roundId);

        // Get judge statistics for this round
        $db = \Config\Database::connect();
        $totalJudges = $db->table('round_judges')
            ->where('round_id', $roundId)
            ->countAllResults();

        $completedJudges = $db->table('round_judges')
            ->where('round_id', $roundId)
            ->where('judge_round_status', 'completed')
            ->countAllResults();
---
SELECT *
FROM `rounds`
WHERE `rounds`.`id` = '7'
SELECT COUNT(*) AS `numrows`
FROM `round_judges`
WHERE `round_id` = '7'
SELECT COUNT(*) AS `numrows`
FROM `round_judges`
WHERE `round_id` = '7'
AND `judge_round_status` = 'completed'

    public function viewContestantDetails($roundId, $contestantId)
    {
        session()->set([
            'user_role' => 'admin',
            'user_name' => session()->get('user_name') ?? 'Admin User'
        ]);

        $round = $this->roundModel->getRoundWithDetails($roundId);
        $contestant = $this->contestantModel->find($contestantId);
---
SELECT *
FROM `contestants`
WHERE `contestants`.`id` = '2'