app/Views/admin/rounds_criteria/index.php

SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
JOIN `round_judges` ON `round_judges`.`judge_id` = `users`.`id` AND `round_judges`.`round_id` = 3
WHERE `roles`.`name` = 'judge'
AND `users`.`status` = 'active'
AND round_judges.completed_at IS NOT NULL
---
                            ->where('users.status', 'active')
                            ->countAllResults();
                        // Count how many active judges have completed this round
                        $completedJudges = $db->table('users')
                            ->join('roles', 'roles.id = users.role_id')
                            ->join('round_judges', 'round_judges.judge_id = users.id AND round_judges.round_id = ' . (int)$round['id'])
                            ->where('roles.name', 'judge')
                            ->where('users.status', 'active')
                            ->where('round_judges.completed_at IS NOT NULL', null, false)
                            ->countAllResults();