app/Views/admin/rounds_criteria/index.php

SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `roles`.`name` = 'judge'
AND `users`.`status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
JOIN `round_judges` ON `round_judges`.`judge_id` = `users`.`id` AND `round_judges`.`round_id` = 7
WHERE `roles`.`name` = 'judge'
AND `users`.`status` = 'active'
AND `round_judges`.`judge_round_status` = 'completed'
---
                        <?php
                        $db = \Config\Database::connect();
                        // Count ALL active judges in the system (not just those who accessed this round)
                        $totalJudges = $db->table('users')
                            ->join('roles', 'roles.id = users.role_id')
                            ->where('roles.name', 'judge')
                            ->where('users.status', 'active')
                            ->countAllResults();
                        // Count how many active judges have completed this round
                        $completedJudges = $db->table('users')
                            ->join('roles', 'roles.id = users.role_id')
                            ->join('round_judges', 'round_judges.judge_id = users.id AND round_judges.round_id = ' . (int)$round['id'])
                            ->where('roles.name', 'judge')
                            ->where('users.status', 'active')
                            ->where('round_judges.judge_round_status', 'completed')
                            ->countAllResults();