app/Models/ContestantModel.php

    public function getContestantsForRound(int $roundId): array
    {
        $db = \Config\Database::connect();

        $contestants = $db->table('round_contestants')
            ->select('contestants.*,
                contestant_details.age,
                contestant_details.height,
                contestant_details.weight,
                contestant_details.advocacy,
                contestant_details.talent,
                contestant_details.hobbies,
                contestant_details.education,
                contestant_contacts.address,
                contestant_contacts.city,
                contestant_contacts.province,
                contestant_contacts.contact_number,
                contestant_contacts.email,
                round_contestants.state')
            ->join('contestants', 'contestants.id = round_contestants.contestant_id')
            ->join('contestant_details', 'contestant_details.contestant_id = contestants.id', 'left')
            ->join('contestant_contacts', 'contestant_contacts.contestant_id = contestants.id', 'left')
            ->where('round_contestants.round_id', $roundId)
            ->where('round_contestants.state !=', 'eliminated')
            ->orderBy('contestants.contestant_number', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `contestants`.*, `contestant_details`.`age`, `contestant_details`.`height`, `contestant_details`.`weight`, `contestant_details`.`advocacy`, `contestant_details`.`talent`, `contestant_details`.`hobbies`, `contestant_details`.`education`, `contestant_contacts`.`address`, `contestant_contacts`.`city`, `contestant_contacts`.`province`, `contestant_contacts`.`contact_number`, `contestant_contacts`.`email`, `round_contestants`.`state`
FROM `round_contestants`
JOIN `contestants` ON `contestants`.`id` = `round_contestants`.`contestant_id`
LEFT JOIN `contestant_details` ON `contestant_details`.`contestant_id` = `contestants`.`id`
LEFT JOIN `contestant_contacts` ON `contestant_contacts`.`contestant_id` = `contestants`.`id`
WHERE `round_contestants`.`round_id` = 5
AND `round_contestants`.`state` != 'eliminated'
ORDER BY `contestants`.`contestant_number` ASC