app/Models/RoleModel.php

    public function getRoleByName(string $name)
    {
        return $this->where('name', $name)->first();
---
SELECT *
FROM `roles`
WHERE `name` = 'judge'
 LIMIT 1