app/Models/RoundModel.php

    public function getRoundWithDetails($id)
    {
        $db = \Config\Database::connect();

        $round = $this->find($id);
        if (!$round) {
            return null;
        }

        // Get criteria directly tied to round
        $criteria = $db->table('round_criteria')
            ->where('round_id', $id)
            ->orderBy('order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `rounds`
WHERE `rounds`.`id` = '5'
SELECT *
FROM `round_criteria`
WHERE `round_id` = '5'
ORDER BY `order` ASC

    public function getAllWithCriteriaCount()
    {
        return $this->select('rounds.*,
                             COUNT(round_criteria.id) as criteria_count')
            ->join('round_criteria', 'round_criteria.round_id = rounds.id', 'left')
            ->groupBy('rounds.id')
            ->orderBy('rounds.round_number', 'ASC')
            ->findAll();
---
SELECT `rounds`.*, COUNT(round_criteria.id) as criteria_count
FROM `rounds`
LEFT JOIN `round_criteria` ON `round_criteria`.`round_id` = `rounds`.`id`
GROUP BY `rounds`.`id`
ORDER BY `rounds`.`round_number` ASC

    public function ensureJudgeAssignments(int $roundId): void
    {
        $round = $this->find($roundId);
        if (!$round) {
            return;
        }

        $db = \Config\Database::connect();

        $activeJudges = $db->table('users')
            ->select('users.id')
            ->join('roles', 'roles.id = users.role_id')
            ->where('roles.name', 'judge')
            ->where('users.status', 'active')
            ->get()
            ->getResultArray();

        if (empty($activeJudges)) {
            return;
        }

        $existingAssignments = $db->table('round_judges')
            ->select('judge_id')
            ->where('round_id', $roundId)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `rounds`
WHERE `rounds`.`id` = 8
SELECT `users`.`id`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `roles`.`name` = 'judge'
AND `users`.`status` = 'active'
SELECT `judge_id`
FROM `round_judges`
WHERE `round_id` = 8