app/Models/ScoreModel.php

SELECT `scores`.*, `rc`.`criteria_name`, `rc`.`percentage`, `rc`.`max_score`, `users`.`full_name` as `judge_name`
FROM `scores`
JOIN `round_criteria` `rc` ON `rc`.`id` = `scores`.`round_criteria_id`
JOIN `users` ON `users`.`id` = `scores`.`judge_id`
WHERE `scores`.`contestant_id` = '2'
AND `scores`.`round_id` = '7'
ORDER BY `rc`.`order` ASC
---
    public function getContestantScoresInRound($contestantId, $roundId)
    {
        $db = \Config\Database::connect();

        return $db->table('scores')
            ->select('scores.*, rc.criteria_name, rc.percentage, rc.max_score, users.full_name as judge_name')
            ->join('round_criteria rc', 'rc.id = scores.round_criteria_id')
            ->join('users', 'users.id = scores.judge_id')
            ->where('scores.contestant_id', $contestantId)
            ->where('scores.round_id', $roundId)
            ->orderBy('rc.order', 'ASC')
            ->get()
            ->getResultArray();

SELECT `s`.`contestant_id`, `s`.`judge_id`, `s`.`score`, `rc`.`max_score` AS `criteria_max`, `rc`.`percentage` AS `criteria_weight`, `contestants`.`contestant_number`, `contestants`.`first_name`, `contestants`.`last_name`
FROM `scores` `s`
JOIN `round_criteria` `rc` ON `rc`.`id` = `s`.`round_criteria_id`
JOIN `contestants` ON `contestants`.`id` = `s`.`contestant_id`
WHERE `s`.`round_id` = '8'
---
    public function getRoundRankings($roundId)
    {
        $db = \Config\Database::connect();

        // Fetch all scoring rows with weight metadata
        $scores = $db->table('scores s')
            ->select('s.contestant_id, s.judge_id, s.score, rc.max_score AS criteria_max, rc.percentage AS criteria_weight, contestants.contestant_number, contestants.first_name, contestants.last_name')
            ->join('round_criteria rc', 'rc.id = s.round_criteria_id')
            ->join('contestants', 'contestants.id = s.contestant_id')
            ->where('s.round_id', $roundId)
            ->get()
            ->getResultArray();

SELECT `state`
FROM `round_contestants`
WHERE `round_id` = '8'
AND `contestant_id` = 1
---
            $total = array_sum($judgeScores);
            $averageScore = $total / $judgeCount;

            $stateRow = $db->table('round_contestants')
                ->select('state')
                ->where('round_id', $roundId)
                ->where('contestant_id', $contestantId)
                ->get()
                ->getRowArray();