app/Models/SettingsModel.php

SELECT *
FROM `settings`
WHERE `setting_key` = 'system_name'
 LIMIT 1
---
    public function getSetting(string $key, $default = null)
    {
        $setting = $this->where('setting_key', $key)->first();

SELECT *
FROM `settings`
---
    public function getAllSettings()
    {
        $settings = $this->findAll();

SELECT *
FROM `settings`
WHERE `setting_key` = 'theme_preset'
 LIMIT 1
UPDATE `settings` SET `setting_value` = 'custom', `updated_at` = '2025-11-14 08:24:14'
WHERE `settings`.`id` IN ('3')
---
    public function setSetting(string $key, $value)
    {
        // Check if setting exists
        $existing = $this->where('setting_key', $key)->first();

        if ($existing) {
            // Update existing setting
            return $this->update($existing['id'], ['setting_value' => $value]);