app/Models/UserModel.php

SELECT `users`.*, `roles`.`name` as `role_name`, `roles`.`display_name` as `role_display_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `username` = 'frenchie@pageant.com'
OR `email` = 'frenchie@pageant.com'
 LIMIT 1
---
    public function verifyCredentials(string $username, string $password)
    {
        $user = $this->select('users.*, roles.name as role_name, roles.display_name as role_display_name')
                     ->join('roles', 'roles.id = users.role_id')
                     ->where('username', $username)
                     ->orWhere('email', $username)
                     ->first();